explaining more in depth about certain concepts
